pluzhnikv/STM32F4_Projects/STM32F4_blink/src/utils.c
/*
 * utils.c
 *
 *  Created on: 20 мая 2015 г.
 *      Author: victor
 */

#include "utils.h"
#include "stm32f4xx_hal.h"

/* ----------------------------------------------------------------------------
 * Initialize PWM
 * pulse  : 0..100 % - Pulse width
 * channel : 1..4    - PWM channel
 ---------------------------------------------------------------------------- */

/* ----------------------------------------------------------------------------
 * Initialize hardware and program variables
 ---------------------------------------------------------------------------- */
extern void Init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct;

	__GPIOA_CLK_ENABLE();
	__GPIOB_CLK_ENABLE();
	__GPIOC_CLK_ENABLE();
	__GPIOH_CLK_ENABLE();
	USART_CLK_ENABLE();
	__TIM1_CLK_ENABLE();
	__TIM2_CLK_ENABLE();
	__TIM3_CLK_ENABLE();
	__TIM5_CLK_ENABLE();

	/* Configure PC13 (user button) as input */
	GPIO_InitStruct.Pin = GPIO_PIN_13;
	GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	/* -2- Configure PA05 */
	GPIO_InitStruct.Pin = GPIO_PIN_5;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	/* -2- Configure PB08 */
	GPIO_InitStruct.Pin = GPIO_PIN_9;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	/**USART2 GPIO Configuration
	 PA2     ------> USART2_TX
	 PA3     ------> USART2_RX
	 */
	GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
	GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	UartHandle.Instance = USART;
	UartHandle.Init.BaudRate = 115200;
	UartHandle.Init.WordLength = UART_WORDLENGTH_8B;
	UartHandle.Init.StopBits = UART_STOPBITS_1;
	UartHandle.Init.Parity = UART_PARITY_NONE;
	UartHandle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	UartHandle.Init.Mode = UART_MODE_TX_RX;
	HAL_UART_Init(&UartHandle);

	htimer.Init.Prescaler = 84;							// Прескалер - 1 микросекунда (такт таймера)
	htimer.Init.CounterMode = TIM_COUNTERMODE_UP;
	htimer.Init.Period = 1000;							// Период - 1 миллисекунда (прерывание таймера)
	htimer.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	htimer.Instance = TIM3;

	HAL_TIM_Base_Init(&htimer);         				// Инициализация таймера

	HAL_NVIC_SetPriority(TIM3_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ(TIM3_IRQn);
}
